Workspace/run/sineWaveDampingLusgsFoam-backward-iter10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       3999;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       4000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       4001;
    }
)

// ************************************************************************* //
